DataProcessors/ЭТ_ЗазрузкаПлатежныхПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЭТ_ЗазрузкаПлатежныхПоручений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрокаПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБанковскихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДатаСчетаТО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодбиратьКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлатежныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Туроператор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаявки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗаявки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПартнера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКлиента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБрони</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаБрони</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выб</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗаявки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗаявкиТекст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаезда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТуроператорИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияБанковскихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыЗаполненияСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыЗаполненияСтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИзКарточкиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПониженнаяУСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВыставленияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыВыставленияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УниверсальныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередаточныйДокументИСчетФактура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЭТ_ЗазрузкаПлатежныхПоручений/Forms/Форма/Ext/Form/Module.bsl
//ПолучитьМассивЗаявок(Параметры)
//На основании структуры полученных данных формирует массив подходящих заявок
&НаСервере
Функция ПолучитьМассивЗаявок(Параметры)
	Возврат ЭТ_ОбщийМодуль2.RequestSearch(Параметры);	
КонецФункции

//ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
//получает настройку пользователя по присланному ключу
&НаСервере
Функция ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку(Ключ,ПоУмолчанию);	
КонецФункции

//ЗаменаHTMLКодов(Знач ВходящаяСтрока)
//заменяет HTML символы на человечиские
&НаСервере
Функция ЗаменаHTMLКодов(Знач ВходящаяСтрока)
	Возврат ЭТ_ОбщийМодуль2.ЗаменаHTMLКодов(ВходящаяСтрока);
КонецФункции

//ПолучитьДанныеЗаявкиПоИД(КодЗаявки)
//получает заявку из СБ по ее коду
&НаСервере
Функция ПолучитьДанныеЗаявкиПоИД(КодЗаявки)
	Парам = Новый Структура;
	Парам.Вставить("id",КодЗаявки);
	Возврат ЭТ_ОбщийМодуль2.Request(Парам);
КонецФункции

//ВидимостьПолей()
//управляет видимостью полей на форме
&НаКлиенте
Процедура ВидимостьПолей()
	ЭтаФорма.Элементы.ГруппаПолейПоиска.Видимость = Ложь;	
	Объект.ПоискКод = Ложь;
	ЭтаФорма.Элементы.ПлатежныеДокументыКодЗаявки.Видимость = Ложь;
	Если ПолучитьНастройку("РежимАдминистратора",Ложь) Тогда
		ЭтаФорма.Элементы.ГруппаПолейПоиска.Видимость = Истина;	
		ЭтаФорма.Элементы.ПлатежныеДокументыКодЗаявки.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

//ПолучитьПлатежныеПорученияНаСервере(СледЭлемент)
//получает перень заявок СБ, собирает итоговую таблицу значений
&НаСервере
Процедура ПолучитьПлатежныеПорученияНаСервере(СледЭлемент)
	Если СледЭлемент.Свойство("id_internal") тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерЗаявки", СледЭлемент.id_internal);
		Если Объект.ПлатежныеДокументы.НайтиСтроки(ПараметрыОтбора).Количество()>0 Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ТаблицаЭлемеент=Объект.ПлатежныеДокументы.Добавить();	
	Если СледЭлемент.Свойство("id_internal") Тогда
		ТаблицаЭлемеент["НомерЗаявки"] = ЗаменаHTMLКодов(СледЭлемент.id_internal);
	КонецЕсли;
	Если СледЭлемент.Свойство("id") Тогда
		ТаблицаЭлемеент["КодЗаявки"] = ЗаменаHTMLКодов(СледЭлемент.id);
	КонецЕсли;	
	Если СледЭлемент.Свойство("supplier_name") Тогда ТаблицаЭлемеент["Туроператор"] = ЗаменаHTMLКодов(СледЭлемент.supplier_name); КонецЕсли;
	Если СледЭлемент.Свойство("supplier_inn") Тогда ТаблицаЭлемеент["ТуроператорИНН"] = ЗаменаHTMLКодов(СледЭлемент.supplier_inn); КонецЕсли;
	Если СледЭлемент.Свойство("calc_price_netto") Тогда ТаблицаЭлемеент["СуммаОплаты"] = ЗаменаHTMLКодов(СледЭлемент.calc_price_netto); КонецЕсли;
	Если СледЭлемент.Свойство("calc_price") Тогда ТаблицаЭлемеент["СуммаКлиента"] = ЗаменаHTMLКодов(СледЭлемент.calc_price); КонецЕсли;
	Если СледЭлемент.Свойство("status_id") Тогда ТаблицаЭлемеент["СтатусЗаявки"] = ЗаменаHTMLКодов(СледЭлемент.status_id); КонецЕсли;
	Если СледЭлемент.Свойство("status") Тогда ТаблицаЭлемеент["СтатусЗаявкиТекст"] = ЗаменаHTMLКодов(СледЭлемент.status); КонецЕсли;
	Если СледЭлемент.Свойство("date_begin") Тогда ТаблицаЭлемеент["ДатаЗаезда"] = ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВДату(ЗаменаHTMLКодов(СледЭлемент.date_begin)); КонецЕсли;
    Если Объект.ПодбиратьКонтрагента Тогда
		Парам = Новый Структура;
		Парам.Вставить("id",СледЭлемент.supplier_id);
		МассивПартненров = ЭТ_ОбщийМодуль2.Supplier(Парам);
		Если МассивПартненров.Количество()>0 тогда
			Для Каждого СледПартнер Из МассивПартненров Цикл
				Если СледПартнер.id = СледЭлемент.supplier_id Тогда
					ТаблицаЭлемеент["ИННПартнера"] = ЗаменаHTMLКодов(СледПартнер.inn); 
					Родитель = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",СледПартнер.inn);
					Если Не Родитель = Справочники.Контрагенты.ПустаяСсылка() Тогда
						ТаблицаЭлемеент["Контрагент"] = Родитель; 
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	Если СледЭлемент.Свойство("reservation_number") Тогда
			МасУдал=Новый Массив;
			МасУдал.Добавить("от");
			МасУдал.Добавить("оТ");
			МасУдал.Добавить("ОТ");
			МасУдал.Добавить("От");
			СтрокаСчета = ЭТ_ОбщийМодуль2.ПолучитьНомерСчета(ЗаменаHTMLКодов(СледЭлемент.reservation_number));
			ДатаСчета = ЭТ_ОбщийМодуль2.ПолучитьДатуИзСтроки(СтрокаСчета);
			Если СтрДлина(СокрЛП(ДатаСчета))<1 или ЭТ_ОбщийМодуль2.ПолучитьНастройку("ТекущаяДатаСчетаТО",Ложь) Тогда ДатаСчета = Строка(ТекущаяДата()); КонецЕсли;
			НомерСчета = ЭТ_ОбщийМодуль2.УдалитьДатуИзСтроки(СтрокаСчета);
			ТаблицаЭлемеент["НомерСчета"] = НомерСчета;
			Если СтрДлина(ДатаСчета)<11 Тогда 
				ТаблицаЭлемеент["ДатаСчета"] = Дата(ДатаСчета+" 00:00:00"); 
			Иначе
				ТаблицаЭлемеент["ДатаСчета"] = ДатаСчета; 
			КонецЕсли;
			СтрокаБрони = ЭТ_ОбщийМодуль2.ПолучитьНомерБрони(ЗаменаHTMLКодов(СледЭлемент.reservation_number));
			ДатаБрони = ЭТ_ОбщийМодуль2.ПолучитьДатуИзСтроки(СтрокаБрони);
			НомерБрони = ЭТ_ОбщийМодуль2.УдалитьДатуИзСтроки(СтрокаБрони);
			ТаблицаЭлемеент["НомерБрони"] = НомерБрони;
			Если СтрДлина(ДатаБрони)>0 Тогда 
				ТаблицаЭлемеент["ДатаБрони"] = Дата(ДатаБрони+" 00:00:00"); 
			Иначе 
				СтроковаяДата = СледЭлемент.dat;
				СтроковаяДата = СтрЗаменить(СтроковаяДата , "-",""); 
				СтроковаяДата = СтрЗаменить(СтроковаяДата , ":",""); 
				СтроковаяДата = СтрЗаменить(СтроковаяДата , " ",""); 
				НоваяДата = Дата(СтроковаяДата);
				ТаблицаЭлемеент["ДатаБрони"] = НоваяДата;
			КонецЕсли;	
		КонецЕсли;
КонецПроцедуры


//ЗаполнитьЗаявки(Парам)
//функция на клиенте, вызывающая циклическое заполнение строк заявок
&НаКлиенте
Процедура ЗаполнитьЗаявки(Парам)
	МассивДанных = ПолучитьМассивЗаявок(Парам);
	Если МассивДанных.Количество()>0 Тогда		
		Для Каждого СледЭлемент Из МассивДанных Цикл
			ПолучитьПлатежныеПорученияНаСервере(СледЭлемент);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//ПолучитьВариантыНомера(СтрокаПоиска)
//согласно присланной строки, возвращает возможные номера заявок
&НаСервере
Функция ПолучитьВариантыНомера(СтрокаПоиска)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьВариантыНомера(СтрокаПоиска);
КонецФункции

//ПолучитьПлатежныеПоручения(Команда)
//нажатие кнопки Получить на форме
&НаКлиенте
Процедура ПолучитьПлатежныеПоручения(Команда)
	ТекущийПрефикс = ПолучитьНастройку("Префикс");
	Объект.ПлатежныеДокументы.Очистить();    
	Элементы.ПлатежныеДокументыКонтрагент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Если Объект.ПоискКод Тогда
		ВариантыНомера = Новый Массив;
		ВариантыНомера.Добавить(СокрЛП(Объект.СтрокаПоиска));
		Для Каждого ВариантНомера Из ВариантыНомера Цикл
			Парам = Новый Структура;
			Парам.Вставить("r_id_system",ВариантНомера);	
			МассивДанных = ПолучитьМассивЗаявок(Парам);
			Если МассивДанных.Количество()>0 Тогда		
				Для Каждого СледЭлемент Из МассивДанных Цикл
					ПолучитьПлатежныеПорученияНаСервере(СледЭлемент);
				КонецЦикла;
			КонецЕсли;		
		КонецЦикла;
	Иначе
		Для Каждого ВариантНомера Из ПолучитьВариантыНомера(Объект.СтрокаПоиска) Цикл
			Парам = Новый Структура;
			Парам.Вставить("r_id_internal",ВариантНомера);	
			МассивДанных = ПолучитьМассивЗаявок(Парам);
			Если МассивДанных.Количество()>0 Тогда		
				Для Каждого СледЭлемент Из МассивДанных Цикл
					ПолучитьПлатежныеПорученияНаСервере(СледЭлемент);
				КонецЦикла;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;		
КонецПроцедуры

//ПриОткрытииНаСервере()
//при открытии формы, определяем типы элементов
&НаСервере
Процедура ПриОткрытииНаСервере()
	Элементы.Организация.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
	Элементы.СчетОрганизации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	Объект.Организация=ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация"); 
	Объект.СчетОрганизации=ЭТ_ОбщийМодуль2.ПолучитьНастройку("СчетОрганизации"); 
	Объект.ОчередностьПлатежа=ЭТ_ОбщийМодуль2.ПолучитьНастройку("ОчередностьПлатежа"); 	
	Объект.Состояние = Перечисления.СостоянияБанковскихДокументов.Подготовлено;
	Объект.ТекущаяДатаСчетаТО=ЭТ_ОбщийМодуль2.ПолучитьНастройку("ТекущаяДатаСчетаТО",Ложь);	      
	Объект.ПодбиратьКонтрагента=ЭТ_ОбщийМодуль2.ПолучитьНастройку("ПодбиратьКонтрагента",Ложь);	      
КонецПроцедуры

//ПриОткрытии(Отказ)
//при открытии формы определяем видимость полей и их типы (см.сервер)
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьПолей();
	ПриОткрытииНаСервере();
КонецПроцедуры

//СохранитьВсеНастройкиНаСервере()
//сохранение настроек формы (сервер)
&НаСервере
Процедура СохранитьВсеНастройкиНаСервере()          	
	ЭТ_ОбщийМодуль2.СохранитьНастройку("ПодбиратьКонтрагента",Объект.ПодбиратьКонтрагента);	
	ЭТ_ОбщийМодуль2.СохранитьНастройку("Организация",Объект.Организация);	
	ЭТ_ОбщийМодуль2.СохранитьНастройку("СчетОрганизации",Объект.СчетОрганизации);	
	ЭТ_ОбщийМодуль2.СохранитьНастройку("ОчередностьПлатежа",Объект.ОчередностьПлатежа);			
	ЭТ_ОбщийМодуль2.СохранитьНастройку("ТекущаяДатаСчетаТО",Объект.ТекущаяДатаСчетаТО);	
КонецПроцедуры

//СохранитьВсеНастройки(Команда)
//сохранение настроек формы (клиент)
&НаКлиенте
Процедура СохранитьВсеНастройки(Команда)
	СохранитьВсеНастройкиНаСервере();
КонецПроцедуры

//ФормироватьДокументыНаСервере(ЭлементДанных)
//процедура генерации платежных документов, согласно выбранных пунктов ТЗ (сервер)
&НаСервере
Процедура ФормироватьДокументыНаСервере(ЭлементДанных)
	Если НЕ ЭлементДанных.Свойство("КодЗаявки") Тогда
		Сообщить("Не указан идентификатор заявки. (ФормироватьДокументыНаСервере/ЭлементДанных.КодЗаявки)");
		Возврат;
	КонецЕсли;
	Заявка = ЭТ_ОбщийМодуль2.Request(Новый Структура("id",ЭлементДанных.КодЗаявки));
	Если Заявка.Количество()<1 Тогда
		Сообщить("Заявка с заданным идентификатором не найдена (ФормироватьДокументыНаСервере/ЭлементДанных.КодЗаявки = "+Строка(ЭлементДанных.КодЗаявки)+")");
		Возврат;
	КонецЕсли;
	Если Год(ЭлементДанных.ДатаСчета)<1900 Тогда ЭлементДанных.ДатаСчета = ТекущаяДата(); КонецЕсли;
	СтатьяДвиженияДенежныхСредств = ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредств");
	Для Каждого ТекущаяЗаявка ИЗ Заявка Цикл
		Договор = ПолучитьДоговорТО(ЭлементДанных,Истина);
		НазначениеПлатежа = "Оплата по ";
		Если СтрДлина(СокрЛП(ЭлементДанных.НомерБрони))>0 Тогда
			НазначениеПлатежа = НазначениеПлатежа + "заявке "+ЭлементДанных.НомерБрони+" ";
		КонецЕсли;
		Если СтрДлина(СокрЛП(ЭлементДанных.НомерСчета))>0 Тогда
			Если СтрДлина(СокрЛП(ЭлементДанных.НомерБрони))>0 Тогда
				НазначениеПлатежа = СокрЛП(НазначениеПлатежа) + ", ";
			КонецЕсли;			
			НазначениеПлатежа = НазначениеПлатежа + "счету № " + ЭлементДанных.НомерСчета+" ";
			Если СтрДлина(СокрЛП(ЭлементДанных.ДатаСчета))>0 Тогда
				НазначениеПлатежа = НазначениеПлатежа + "от "+Формат(ЭлементДанных.ДатаСчета, "ДЛФ=Д")+" ";			
			КонецЕсли;		
		КонецЕсли;                                                                                                	
		НазначениеПлатежа = НазначениеПлатежа + "за тур.услуги ";
		Если СтрДлина(СокрЛП(ЭлементДанных.ДатаЗаезда))>0 Тогда
			НазначениеПлатежа = НазначениеПлатежа + "от "+Лев(СокрЛП(ЭлементДанных.ДатаЗаезда),10)+" ";
		КонецЕсли;
		Если СтрДлина(СокрЛП(ЭлементДанных.НомерЗаявки))>0 Тогда		
			НазначениеПлатежа = НазначениеПлатежа + "("+СокрЛП(ЭлементДанных.НомерЗаявки)+") ";
		КонецЕсли;
		НазначениеПлатежа = НазначениеПлатежа + "Сумма "+Формат(ЭлементДанных.СуммаОплаты,"ЧДЦ=2; ЧРД='-'; ЧГ=0")+" Без налога (НДС)";
		НовоеПлатежноеПоручение = Документы.ПлатежноеПоручение.СоздатьДокумент();
		НовоеПлатежноеПоручение.Организация = Объект.Организация;
		НовоеПлатежноеПоручение.СчетОрганизации = Объект.СчетОрганизации;
		НовоеПлатежноеПоручение.Контрагент = ЭлементДанных.Контрагент;
		НовоеПлатежноеПоручение.СчетКонтрагента = ЭлементДанных.Контрагент.ОсновнойБанковскийСчет;
		НовоеПлатежноеПоручение.СуммаДокумента = ЭлементДанных.СуммаОплаты;
		НовоеПлатежноеПоручение.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		НовоеПлатежноеПоручение.ВидПлатежа = "Электронно";
		НовоеПлатежноеПоручение.ОчередностьПлатежа = Объект.ОчередностьПлатежа;
		НовоеПлатежноеПоручение.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
		НовоеПлатежноеПоручение.ТекстПлательщика = Объект.Организация.НаименованиеПолное;
		НовоеПлатежноеПоручение.ТекстПолучателя = ЭлементДанных.Контрагент.НаименованиеПолное;
		НовоеПлатежноеПоручение.ИННПлательщика = Объект.Организация.ИНН;
		НовоеПлатежноеПоручение.ИННПолучателя = ЭлементДанных.Контрагент.ИНН;
		НовоеПлатежноеПоручение.Ответственный = ПользователиИнформационнойБазы.ТекущийПользователь();
		НовоеПлатежноеПоручение.ПеречислениеВБюджет = ложь;
		НовоеПлатежноеПоручение.ДоговорКонтрагента = Договор.Ссылка;
		НовоеПлатежноеПоручение.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		НовоеПлатежноеПоручение.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику;
		НовоеПлатежноеПоручение.Дата = ТекущаяДата();
		Шаблон = Эт_ОбщийМодуль2.ОснованиеПлатежаПоШаблону(ЭлементДанных.Контрагент.Код,Новый Структура("бронь,сумма",СокрЛП(Договор.Номер),ЭлементДанных.СуммаОплаты));
		Если СтрДлина(СокрЛП(Шаблон))>0 Тогда 
			НовоеПлатежноеПоручение.НазначениеПлатежа = Шаблон; 
		Иначе
			НовоеПлатежноеПоручение.НазначениеПлатежа = НазначениеПлатежа;			
		КонецЕсли;
		НовоеПлатежноеПоручение.Записать();
		РегистрыСведений.СостоянияБанковскихДокументов.УстановитьСостояниеДокумента(НовоеПлатежноеПоручение.Ссылка, Объект.Состояние);
		Сообщить("Создан документ: " + НовоеПлатежноеПоручение);
	КонецЦикла;	
КонецПроцедуры

//ФормироватьДокументы(Команда)
//процедура генерации платежных документов, согласно выбранных пунктов ТЗ (клиент)
//здесь просто готовим ТЗ и передаем ее на сервер для дальнейшей работы
&НаКлиенте
Процедура ФормироватьДокументы(Команда)
	Для Каждого ЭлементДанных  Из Объект.ПлатежныеДокументы Цикл
		Если ЭлементДанных.Выб = Истина Тогда
			Если ПолучитьНастройку("ТекущаяДатаСчетаТО",Ложь) Тогда 
				ДатаСчета = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"); 
			Иначе
				ДатаСчета = ЭлементДанных.ДатаСчета;
			КонецЕсли;
			Парам = Новый Структура;
			Парам.Вставить("КодЗаявки",Число(ЭлементДанных.КодЗаявки)); //КодЗаявки	"15"	Строка
			Парам.Вставить("НомерЗаявки",ЭлементДанных.НомерЗаявки); //НомерЗаявки	"ЭТ18 - 117960"	Строка
			Парам.Вставить("СтатусЗаявкиТекст",ЭлементДанных.СтатусЗаявкиТекст); //СтатусЗаявкиТекст	"Подтверждена"	Строка (Чтение)
			Парам.Вставить("СтатусЗаявки",ЭлементДанных.СтатусЗаявки); //СтатусЗаявки	2	Число (Чтение)
			Парам.Вставить("Туроператор",ЭлементДанных.Туроператор); //Туроператор	"АНЕКС МАГАЗИН РЕГИОН  (Anex)"	Строка (Чтение)
			Парам.Вставить("Контрагент",ЭлементДанных.Контрагент); //Контрагент	Общество с ограниченной ответственностью "АНЕКС МАГАЗИН РЕГИОН"	СправочникСсылка.Контрагенты
			Парам.Вставить("НомерСчета",ЭлементДанных.НомерСчета); //НомерСчета	"2  "	Строка
			Парам.Вставить("ДатаСчета",ДатаСчета); //ДатаСчета	13.01.2018 0:00:00	Дата
			Парам.Вставить("НомерБрони",ЭлементДанных.НомерБрони); //НомерБрони	"1  "	Строка
			Парам.Вставить("ДатаБрони",ЭлементДанных.ДатаБрони); //ДатаБрони	12.01.2018 0:00:00	Дата
			Парам.Вставить("СуммаОплаты",ЭлементДанных.СуммаОплаты); //СуммаОплаты	57 800	Число
			Парам.Вставить("ИННПартнера",ЭлементДанных.ИННПартнера); //ИННПартнера	"7706797581"	Строка (Чтение,Скрыт)
			Парам.Вставить("СуммаКлиента",ЭлементДанных.СуммаКлиента); //СуммаКлиента	64 215,8	Число (Чтение,Скрыт)			
			Парам.Вставить("ДатаЗаезда",ЭлементДанных.ДатаЗаезда); //ДатаЗаезда	13.01.2018 0:00:00	Дата
			Парам.Вставить("ТуроператорИНН",ЭлементДанных.ТуроператорИНН); //Туроператор	"АНЕКС МАГАЗИН РЕГИОН  (Anex)"	Строка (Чтение)
			ФормироватьДокументыНаСервере(Парам);
		КонецЕсли;
    КонецЦикла; 	
КонецПроцедуры

//ПолучитьДоговорТО(Данные, Создовать = ложь) Экспорт
//согласно полученным данным ищет договорТО  в 1С, если такого нет, и Создовать = Истина, то создает его
//возвращает ссылку на договор, или Null 
&НаСервере
Функция ПолучитьДоговорТО(Данные, Создовать = ложь) Экспорт
	//НомерБрони ДатаБрони Партнер
	КВозврату = Null;
	ЕстьОшибки = Ложь;
	ТекстОшибки = Новый Массив;
	Если СтрДлина(СокрЛП(Данные.НомерБрони))<1 Тогда ЕстьОшибки = Истина; ТекстОшибки.Добавить("Не указан номер брони"); КонецЕсли;
	Если СтрДлина(СокрЛП(Данные.ДатаБрони))<1 Тогда ЕстьОшибки = Истина; ТекстОшибки.Добавить("Не указана дата брони");  КонецЕсли;
	Если Данные.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда ЕстьОшибки = Истина; ТекстОшибки.Добавить("Не выбран поставщик услуг"); КонецЕсли;
	Если ЕстьОшибки = Ложь Тогда		
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(Данные.Контрагент.Код);
		ДатаБрони = СокрЛП(Данные.ДатаБрони);
		НомерБрони = СокрЛП(Данные.НомерБрони);
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|    ДоговорыКонтрагентов.Код Как Код,
		|    ДоговорыКонтрагентов.Ссылка Как ДоговорыКонтрагентовСсылка,
		|    ДоговорыКонтрагентов.Дата Как Дата
		|ИЗ
		|    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Номер = &НомерДоговора
		|	И ДоговорыКонтрагентов.Дата = &ДатаДоговора
		|	И ДоговорыКонтрагентов.Владелец = &Партнер";
		Запрос.УстановитьПараметр("НомерДоговора", НомерБрони);
		Запрос.УстановитьПараметр("ДатаДоговора", Дата(ДатаБрони));
		Запрос.УстановитьПараметр("Партнер", Контрагент.Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Количество = Выборка.Количество();
		Если Количество>0 Тогда
			Пока Выборка.Следующий() Цикл
				Если КВозврату = Null Тогда
					КВозврату = Выборка.ДоговорыКонтрагентовСсылка;
				КонецЕсли;
			КонецЦикла;   		
		Иначе
			Если Создовать = Истина Тогда
				НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
				НовыйДоговор.Организация = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация");
				ВидДоговора = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораТО");				
				МояОрганизация = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация",Справочники.Организации.ПустаяСсылка());
				//МояОрганизация = Справочники.Организации.ПустаяСсылка();
				Если Не МояОрганизация.Пустая() Тогда
					Если Данные.ТуроператорИНН = МояОрганизация.ИНН Тогда
						ВидДоговора = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораПоставщик");	
						Сообщить("Внимание! Наша компания является туроператором по заявке!",СтатусСообщения.Внимание);
					КонецЕсли;					
				КонецЕсли;
				
				НовыйДоговор.ВидДоговора = ВидДоговора;				
				НовыйДоговор.Дата = Данные.ДатаБрони;
				НовыйДоговор.Номер = СокрЛП(Данные.НомерБрони);
				НовыйДоговор.Наименование = СокрЛП(Данные.НомерБрони) + " от " + Лев(Строка(Данные.ДатаБрони),10) + " ( "+Данные.НомерЗаявки+" )";
				НовыйДоговор.Владелец = Данные.Контрагент;
				НовыйДоговор.ВалютаВзаиморасчетов = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВалютаДокументов1С",Справочники.Валюты.ПустаяСсылка());		
				НовыйДоговор.СпособЗаполненияСтавкиНДС = Перечисления.СпособыЗаполненияСтавкиНДС.БезНДС;
				НовыйДоговор.СпособВыставленияДокументов = Перечисления.СпособыВыставленияДокументов.Автоматически;
				НовыйДоговор.Записать();
				Сообщение = "Для ТО "+Данные.Контрагент+" создан новый договор (бронь) "+НовыйДоговор.Наименование;
				Сообщить(Сообщение,СтатусСообщения.Информация);
				КВозврату = НовыйДоговор;
				
			КонецЕсли;			
		КонецЕсли;
	Иначе
		ТекстОшибкиВСтроку = "";
		Разделитель = ", ";
		Для Каждого СлОшибка Из ТекстОшибки Цикл
			Если СтрДлина(СокрЛП(ТекстОшибкиВСтроку))>0 Тогда ТекстОшибкиВСтроку = ТекстОшибкиВСтроку+Разделитель; КонецЕсли;
			ТекстОшибкиВСтроку = СлОшибка;
		КонецЦикла;
		Сообщить(ТекстОшибкиВСтроку, СтатусСообщения.Внимание);		
	КонецЕсли;
	Возврат КВозврату;
КонецФункции
